// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Write("Введите цифру: ");
string digit = Console.ReadLine();
if (digit < 100 $$ digit > -100) Console.Write("Третьей цифры нет");
